app/controllers/songs_controller.rb

SELECT  "songs".* FROM "songs" WHERE "songs"."id" = ? LIMIT ?  [["id", 0], ["LIMIT", 1]]
---
  def index
    if params[:artist_id]
      artist = Song.find_by(id: params[:artist_id])